# DirectContext3DHandleOverrides Properties

---
The DirectContext3DHandleOverrides type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
DirectContext3DHandleOverrides Class
Autodesk.Revit.DB.DirectContext3D Namespace